{"backend": "tensorflow", "class_name": "Model", "keras_version": "2.0.8", "config": {"name": "model_1", "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_1", "config": {"dtype": "float32", "name": "input_1", "batch_input_shape": [null, 140, 41], "sparse": false}}, {"class_name": "LSTM", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "lstm_1", "config": {"kernel_constraint": null, "name": "lstm_1", "implementation": 0, "recurrent_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "batch_input_shape": [null, 140, 41], "use_bias": true, "recurrent_dropout": 0.0, "stateful": false, "activation": "tanh", "dropout": 0.0, "return_state": false, "kernel_regularizer": null, "return_sequences": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "dtype": "float32", "recurrent_activation": "hard_sigmoid", "unroll": false, "recurrent_constraint": null, "bias_constraint": null, "units": 256, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "go_backwards": false, "trainable": true}}, {"class_name": "LSTM", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "lstm_2", "config": {"kernel_constraint": null, "name": "lstm_2", "implementation": 0, "recurrent_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "batch_input_shape": [null, 140, 41], "use_bias": true, "recurrent_dropout": 0.0, "stateful": false, "activation": "tanh", "dropout": 0.0, "return_state": false, "kernel_regularizer": null, "return_sequences": true, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "dtype": "float32", "recurrent_activation": "hard_sigmoid", "unroll": false, "recurrent_constraint": null, "bias_constraint": null, "units": 256, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "go_backwards": false, "trainable": true}}, {"class_name": "Concatenate", "inbound_nodes": [[["lstm_1", 0, 0, {}], ["lstm_2", 0, 0, {}]]], "name": "concatenate_1", "config": {"name": "concatenate_1", "trainable": true, "axis": -1}}, {"class_name": "Dropout", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "name": "dropout_1", "config": {"rate": 0.1, "name": "dropout_1", "trainable": true}}, {"class_name": "LSTM", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "lstm_3", "config": {"kernel_constraint": null, "name": "lstm_3", "implementation": 0, "recurrent_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "batch_input_shape": [null, 140, 41], "use_bias": true, "recurrent_dropout": 0.0, "stateful": false, "activation": "tanh", "dropout": 0.0, "return_state": false, "kernel_regularizer": null, "return_sequences": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "dtype": "float32", "recurrent_activation": "hard_sigmoid", "unroll": false, "recurrent_constraint": null, "bias_constraint": null, "units": 256, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "go_backwards": false, "trainable": true}}, {"class_name": "LSTM", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "lstm_4", "config": {"kernel_constraint": null, "name": "lstm_4", "implementation": 0, "recurrent_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "batch_input_shape": [null, 140, 41], "use_bias": true, "recurrent_dropout": 0.0, "stateful": false, "activation": "tanh", "dropout": 0.0, "return_state": false, "kernel_regularizer": null, "return_sequences": false, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "dtype": "float32", "recurrent_activation": "hard_sigmoid", "unroll": false, "recurrent_constraint": null, "bias_constraint": null, "units": 256, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "go_backwards": false, "trainable": true}}, {"class_name": "Concatenate", "inbound_nodes": [[["lstm_3", 0, 0, {}], ["lstm_4", 0, 0, {}]]], "name": "concatenate_2", "config": {"name": "concatenate_2", "trainable": true, "axis": -1}}, {"class_name": "Dropout", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "name": "dropout_2", "config": {"rate": 0.1, "name": "dropout_2", "trainable": true}}, {"class_name": "Dense", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "dense_1", "config": {"activation": "tanh", "kernel_constraint": null, "kernel_regularizer": null, "name": "dense_1", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "trainable": true, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}}}, {"class_name": "Dropout", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dropout_3", "config": {"rate": 0.1, "name": "dropout_3", "trainable": true}}, {"class_name": "Dense", "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "name": "dense_2", "config": {"activation": "tanh", "kernel_constraint": null, "kernel_regularizer": null, "name": "dense_2", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 7, "trainable": true, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}}}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_2", 0, 0]]}}