{"class_name": "Model", "config": {"name": "model_1", "output_layers": [["dense_2", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_1", "sparse": false, "dtype": "float32", "batch_input_shape": [null, 140, 41]}}, {"name": "gru_1", "class_name": "GRU", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"return_state": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "recurrent_constraint": null, "dtype": "float32", "go_backwards": false, "stateful": false, "dropout": 0.0, "name": "gru_1", "implementation": 0, "batch_input_shape": [null, 140, 41], "bias_constraint": null, "use_bias": true, "activation": "tanh", "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "return_sequences": true, "recurrent_activation": "hard_sigmoid", "unroll": false, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "activity_regularizer": null, "recurrent_regularizer": null, "kernel_regularizer": null}}, {"name": "gru_2", "class_name": "GRU", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"return_state": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "recurrent_constraint": null, "dtype": "float32", "go_backwards": false, "stateful": false, "dropout": 0.0, "name": "gru_2", "implementation": 0, "batch_input_shape": [null, 140, 41], "bias_constraint": null, "use_bias": true, "activation": "tanh", "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "return_sequences": true, "recurrent_activation": "hard_sigmoid", "unroll": false, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "activity_regularizer": null, "recurrent_regularizer": null, "kernel_regularizer": null}}, {"name": "concatenate_1", "class_name": "Concatenate", "inbound_nodes": [[["gru_1", 0, 0, {}], ["gru_2", 0, 0, {}]]], "config": {"name": "concatenate_1", "axis": -1, "trainable": true}}, {"name": "gru_3", "class_name": "GRU", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "config": {"return_state": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "recurrent_constraint": null, "dtype": "float32", "go_backwards": false, "stateful": false, "dropout": 0.0, "name": "gru_3", "implementation": 0, "batch_input_shape": [null, 140, 41], "bias_constraint": null, "use_bias": true, "activation": "tanh", "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "return_sequences": false, "recurrent_activation": "hard_sigmoid", "unroll": false, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "activity_regularizer": null, "recurrent_regularizer": null, "kernel_regularizer": null}}, {"name": "gru_4", "class_name": "GRU", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "config": {"return_state": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "recurrent_constraint": null, "dtype": "float32", "go_backwards": false, "stateful": false, "dropout": 0.0, "name": "gru_4", "implementation": 0, "batch_input_shape": [null, 140, 41], "bias_constraint": null, "use_bias": true, "activation": "tanh", "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "return_sequences": false, "recurrent_activation": "hard_sigmoid", "unroll": false, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "activity_regularizer": null, "recurrent_regularizer": null, "kernel_regularizer": null}}, {"name": "concatenate_2", "class_name": "Concatenate", "inbound_nodes": [[["gru_3", 0, 0, {}], ["gru_4", 0, 0, {}]]], "config": {"name": "concatenate_2", "axis": -1, "trainable": true}}, {"name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "config": {"use_bias": true, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "name": "dense_1", "bias_constraint": null, "activity_regularizer": null}}, {"name": "dense_2", "class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "config": {"use_bias": true, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 7, "bias_regularizer": null, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "name": "dense_2", "bias_constraint": null, "activity_regularizer": null}}], "input_layers": [["input_1", 0, 0]]}, "keras_version": "2.0.8", "backend": "tensorflow"}