{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.0.8", "config": {"layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"name": "input_1", "sparse": false, "batch_input_shape": [null, 20, 15, 41], "dtype": "float32"}, "inbound_nodes": []}, {"class_name": "TimeDistributed", "name": "time_distributed_1", "config": {"trainable": true, "name": "time_distributed_1", "layer": {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "name": "dense_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "tanh", "units": 32, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null}}}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_2", "config": {"trainable": true, "name": "time_distributed_2", "layer": {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "name": "dense_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "tanh", "units": 16, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null}}}, "inbound_nodes": [[["time_distributed_1", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_3", "config": {"trainable": true, "name": "time_distributed_3", "layer": {"class_name": "GRU", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "implementation": 0, "stateful": false, "name": "gru_1", "recurrent_activation": "hard_sigmoid", "go_backwards": false, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "dtype": "float32", "trainable": true, "batch_input_shape": [null, 15, 41], "kernel_regularizer": null, "return_sequences": true, "recurrent_constraint": null, "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "tanh", "return_state": false, "units": 64, "bias_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_constraint": null, "recurrent_dropout": 0.0, "unroll": false}}}, "inbound_nodes": [[["time_distributed_2", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "time_distributed_4", "config": {"trainable": true, "name": "time_distributed_4", "layer": {"class_name": "GRU", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "implementation": 0, "stateful": false, "name": "gru_2", "recurrent_activation": "hard_sigmoid", "go_backwards": false, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "dtype": "float32", "trainable": true, "batch_input_shape": [null, 15, 41], "kernel_regularizer": null, "return_sequences": false, "recurrent_constraint": null, "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "tanh", "return_state": false, "units": 64, "bias_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_constraint": null, "recurrent_dropout": 0.0, "unroll": false}}}, "inbound_nodes": [[["time_distributed_3", 0, 0, {}]]]}, {"class_name": "GRU", "name": "gru_3", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "dropout": 0.0, "implementation": 0, "stateful": false, "name": "gru_3", "recurrent_activation": "hard_sigmoid", "go_backwards": false, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "dtype": "float32", "trainable": true, "batch_input_shape": [null, 20, 41], "kernel_regularizer": null, "return_sequences": false, "recurrent_constraint": null, "recurrent_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "tanh", "return_state": false, "units": 256, "bias_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "kernel_constraint": null, "recurrent_dropout": 0.0, "unroll": false}, "inbound_nodes": [[["time_distributed_4", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_3", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "name": "dense_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "tanh", "units": 256, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null}, "inbound_nodes": [[["gru_3", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_4", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "name": "dense_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "tanh", "units": 7, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null}, "inbound_nodes": [[["dense_3", 0, 0, {}]]]}], "name": "model_1", "output_layers": [["dense_4", 0, 0]], "input_layers": [["input_1", 0, 0]]}}