{"backend": "tensorflow", "keras_version": "2.0.8", "config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_2", 0, 0]], "layers": [{"inbound_nodes": [], "name": "input_1", "config": {"name": "input_1", "dtype": "float32", "sparse": false, "batch_input_shape": [null, 140, 41]}, "class_name": "InputLayer"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "lstm_1", "config": {"return_state": false, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activation": "tanh", "name": "lstm_1", "batch_input_shape": [null, 140, 41], "recurrent_constraint": null, "kernel_constraint": null, "unroll": false, "implementation": 0, "go_backwards": false, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null, "recurrent_dropout": 0.0, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dtype": "float32", "trainable": true, "recurrent_regularizer": null, "return_sequences": true, "unit_forget_bias": true, "units": 256, "dropout": 0.0, "stateful": false}, "class_name": "LSTM"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "lstm_2", "config": {"return_state": false, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activation": "tanh", "name": "lstm_2", "batch_input_shape": [null, 140, 41], "recurrent_constraint": null, "kernel_constraint": null, "unroll": false, "implementation": 0, "go_backwards": false, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null, "recurrent_dropout": 0.0, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dtype": "float32", "trainable": true, "recurrent_regularizer": null, "return_sequences": true, "unit_forget_bias": true, "units": 256, "dropout": 0.0, "stateful": false}, "class_name": "LSTM"}, {"inbound_nodes": [[["lstm_1", 0, 0, {}], ["lstm_2", 0, 0, {}]]], "name": "concatenate_1", "config": {"name": "concatenate_1", "trainable": true, "axis": -1}, "class_name": "Concatenate"}, {"inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "name": "lstm_3", "config": {"return_state": false, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activation": "tanh", "name": "lstm_3", "batch_input_shape": [null, 140, 41], "recurrent_constraint": null, "kernel_constraint": null, "unroll": false, "implementation": 0, "go_backwards": false, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null, "recurrent_dropout": 0.0, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dtype": "float32", "trainable": true, "recurrent_regularizer": null, "return_sequences": false, "unit_forget_bias": true, "units": 256, "dropout": 0.0, "stateful": false}, "class_name": "LSTM"}, {"inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "name": "lstm_4", "config": {"return_state": false, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activation": "tanh", "name": "lstm_4", "batch_input_shape": [null, 140, 41], "recurrent_constraint": null, "kernel_constraint": null, "unroll": false, "implementation": 0, "go_backwards": false, "bias_regularizer": null, "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "activity_regularizer": null, "recurrent_dropout": 0.0, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "dtype": "float32", "trainable": true, "recurrent_regularizer": null, "return_sequences": false, "unit_forget_bias": true, "units": 256, "dropout": 0.0, "stateful": false}, "class_name": "LSTM"}, {"inbound_nodes": [[["lstm_3", 0, 0, {}], ["lstm_4", 0, 0, {}]]], "name": "concatenate_2", "config": {"name": "concatenate_2", "trainable": true, "axis": -1}, "class_name": "Concatenate"}, {"inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "name": "dense_1", "config": {"kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "activation": "tanh", "name": "dense_1", "kernel_constraint": null, "trainable": true, "use_bias": true, "bias_regularizer": null, "units": 512}, "class_name": "Dense"}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dense_2", "config": {"kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "activation": "tanh", "name": "dense_2", "kernel_constraint": null, "trainable": true, "use_bias": true, "bias_regularizer": null, "units": 7}, "class_name": "Dense"}]}, "class_name": "Model"}